PeterJhon/sdk-bsp-psoc_e84-edgi-talk/libraries/components/mtb-device-support-pse8xxgp/pdl/drivers/include/cy_syspm.h
/*******************************************************************************
* Function Name: Cy_SysPm_Cm33IsSleep
****************************************************************************//**
*
* Checks if the CM33 is in the sleep mode.
*
* \return
* true - if the CM33 is in the sleep mode,
* false - if the CM33 is not in the sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm33IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm33IsDeepSleep
****************************************************************************//**
*
* Checks if the CM33 is in the deep sleep mode.
*
* \return
* true - if CM33 is in the deep sleep mode, false - if the CM33 is not in
* the deep sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm33IsDeepSleep(void);

/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsActive
****************************************************************************//**
*
* Checks if CM55 is in the active mode.
*
* \return
* true - if CM55 is in the active mode, false - if the CM55 is not in active mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsActive(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsSleep
****************************************************************************//**
*
* Checks if the CM55 is in the sleep mode.
*
* \return
* true - if the CM55 is in the sleep mode,
* false - if the CM55 is not in the sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsSleep(void);


/*******************************************************************************
* Function Name: Cy_SysPm_Cm55IsDeepSleep
****************************************************************************//**
*
* Checks if the CM55 is in the deep sleep mode.
*
* \return
* true - if CM55 is in the deep sleep mode, false - if the CM55 is not in
* the deep sleep mode.
*
*******************************************************************************/
bool Cy_SysPm_Cm55IsDeepSleep(void);

#endif

/** \} group_syspm_functions_power_status */


/**
* \addtogroup group_syspm_functions_power
* \{
*/
/*******************************************************************************
* Function Name: Cy_SysPm_CpuSendWakeupEvent
****************************************************************************//**
*
* Sends the SEV (Send Event) ARM instruction to the system.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_CpuSendWakeupEvent
*
*******************************************************************************/
void Cy_SysPm_CpuSendWakeupEvent(void);

#if defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)
/*******************************************************************************
* Function Name: Cy_SysPm_SystemIsMinRegulatorCurrentSet
****************************************************************************//**
*
* Check whether the system regulator is set to minimal current mode.
*
* \return
* - True - system is in regulator minimum current mode.
* - False - system is in normal regulator current mode.
*
* \funcusage
* \snippet syspm/snippet/main.c snippet_Cy_SysPm_SystemSetNormalRegulatorCurrent
*
*******************************************************************************/
bool Cy_SysPm_SystemIsMinRegulatorCurrentSet(void);
#endif /* defined (CY_IP_MXS40SRSS) || defined (CY_IP_MXS40SSRSS) || defined (CY_DOXYGEN) */
/** \} group_syspm_functions_power */


#if defined (CY_IP_MXS40SSRSS) || defined (CY_IP_MXS22SRSS) || defined (CY_DOXYGEN)

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckSetVoltage
****************************************************************************//**
*
* Set the Core Buck Regulator Voltage
*
* \param voltage
* Pick from \ref cy_en_syspm_core_buck_voltage_t
*
* \return
* see \ref cy_en_syspm_status_t.
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_CoreBuckSetVoltage(cy_en_syspm_core_buck_voltage_t voltage);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckGetVoltage
****************************************************************************//**
*
* Get the Core Buck Regulator Voltage
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_buck_voltage_t
*
*******************************************************************************/
cy_en_syspm_core_buck_voltage_t Cy_SysPm_CoreBuckGetVoltage(void);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckSetMode
****************************************************************************//**
*
* Set the Core Buck Regulator mode
*
* \param mode
* Pick from \ref cy_en_syspm_core_buck_mode_t
*
*******************************************************************************/
void Cy_SysPm_CoreBuckSetMode(cy_en_syspm_core_buck_mode_t mode);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckGetMode
****************************************************************************//**
*
* Get the Core Buck Regulator Mode
*
* \return
* Gets enum value of type \ref cy_en_syspm_core_buck_mode_t
*
*******************************************************************************/
cy_en_syspm_core_buck_mode_t Cy_SysPm_CoreBuckGetMode(void);

/*******************************************************************************
* Function Name: Cy_SysPm_CoreBuckStatus
****************************************************************************//**
*
* Get the status of Core Buck Regulator
*
* \return
* Gets enum value of type \ref cy_en_syspm_status_t
*
*******************************************************************************/
cy_en_syspm_status_t Cy_SysPm_CoreBuckStatus(void);

#if defined (CY_IP_MXS22SRSS)  || defined (CY_DOXYGEN)

